Repository: MugeSo/Agavi-FAQ-L10n
Catalog: ja/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: en
ja: ja

source: Agavi common questions and answers (FAQ)
ja: Agaviの一般的な質問と答え (FAQ)

source: Frequently Asked Questions (FAQ) - Agavi PHP Framework
ja: よくある質問 (FAQ) - Agavi PHP フレームワーク

source: Visit Agavi FAQ on GitHub...
ja: GitHub上のAgavi FAQを見てください ...

source: I uploaded this document to github.
ja: 私はこのドキュメントをgithubにアップロードしました。

source: You can find it under http://github.com/graste/Agavi-FAQ.
ja: http://github.com/graste/Agavi-FAQにあります。

source: This unofficial FAQ is a work in progress.
ja: この非公式 FAQ は鋭意制作中です。

source: All information is provided as is without any guarantees.
ja: すべての情報は保障なく提供されます。

source: Use it at your own risk.
ja: あなたの責任でご利用ください。

source: Go to IRC info page
ja: IRC情報ページへ

source: Go to mailing list info page
ja: メーリングリスト情報ページへ

source: Go to IRC logs page
ja: IRCログページへ

source: Go to trac SVN view of Agavi 1.0 sources...
ja: Agavi 1.0ソース のtrac SVN view ...

source: Go to trac SVN view of Agavi 1.0 sample application...
ja: Agavi 1.0 サンプルアプリケーションの trac SVN view ...

source: Send email to author
ja: 著者にメールする

source: On this page a few common questions are answered.
ja: このページではわずかな一般的な質問に答えています。

source: Examples are given where appropriate.
ja: 必要に応じて例示しています。

source: If you have questions that are not answered here, visit the user mailing list, join the IRC channel or search through mailing list archive or IRC channel logs as a start.
ja: もしこのページで答えられていない質問がある場合は、メーリングリストを訪れたり、IRCチャンネルに参加したり、とりあえずメーリングリストアーカイブ や IRCチャンネルログを検索したりしてください。

source: The Agavi source code is well documented and the sample application should give you some good practices to start with.
ja: Agaviのソースコード はよくドキュメントが書かれていて 、サンプルアプリケーションも始めるにあたっての優れた実例を示してくれます。

source: In case you want a question added here, ask via mail (agavi-faq@mivesto.de) or visit the IRC channel (ask graste).
ja: ここに質問を追加したい場合は、メール (agavi-faq@mivesto.de) で問い合わせるか、IRCチャンネルに来てください (grasteに聞いてください)。

source: The examples in this FAQ are skeletons most of the time.
ja: このFAQの例はほとんどの場合スケルトンです。

source: It is recommended to be strict when checking user input such as header variables, cookies, files or request parameters.
ja: ユーザー入力をチェックする場合は厳密に行うことが推奨されます。ユーザー入力とはヘダー変数、クッキー、ファイル、リクエストパラメータなどです。

source: The validator examples are just there to get you started with some features.
ja: バリデータの例は機能の取っ掛かりとして示されているにすぎません。

source: The usage of fragment caching may lead to side effects if you define caches only for production environment and then begin to wonder why some code or slot or whatever doesn't get executed as it always was before.
ja: フラグメントキャッシュの使用は副作用をもたらすことがあります。もし製品環境でのみフラグメントキャッシュを定義して、かつコードやスロットや何かが以前のように動かなくなったとしたら、そういうことです。

source: Please think twice before copying and pasting example code (which is not production ready on itself most of the time).
ja: よく考えてから例示コードをコピー＆ペーストしてください。(多くの場合例示コードは製品向けではありません。)

source: Go to 'No Best Practices' article by James Bach...
ja: James Bachによる'No Best Practices' の記事 ...

source: Go to introductory Agavi quick start tutorial...
ja: 初歩のAgaviクイックスタートチュートリアルへ...

source: Most good practices or patterns are probably to be found in the sample application or the official Agavi quick start tutorial.
ja: ほとんどの よい習慣やパターンはおそらくサンプルアプリケーションや公式のAgaviクイックスタートチュートリアルに書かれています。

source: With Agavi you can have different contexts (think 'web', 'console' or 'soap') and multiple environments (like 'development', 'staging', 'production' etc.).
ja: Agaviを使用すると、異なるコンテキスト ('web'や 'console' 、 'soap'と考えてください) と複数の環境 (たとえば'development', 'staging', 'production' など.)を持つことができます。

source: The <ae:configuration> sections in the config files are sorted first (vanilla, environment-only, context-only, environment+context) and then merged together. Knowing this, you can just define default settings and then overwrite them in context- or environment-specific sections.
ja: 設定ファイル内の<ae:configuration> セクションはまずソートされ(通常, 環境だけ, コンテキストだけ, 環境とコンテキスト)統合されます。 これを知っていれば、既定の設定を定義し、コンテキストまたは環境固有のセクションでそれらを上書きできます。

source: Some examples below make use of this.
ja: いくつかの例はこれらを利用しています。

source: You may use regular expressions like this in the attribute: environment="development.*".
ja: 次のような正規表現を属性値で利用するかもしれません。environment="development.*"です。

source: This would allow for common settings for all environments that start with development (so John and Chuck from your dev-team get those settings in their private development-john-rambo or development-chuck-norris configuration sections).
ja: これはdevelopment で始まるすべての環境に対する共通の設定を許します(つまり、 開発チームのJohn と Chuckはそれらの設定を彼らの個人的な development-john-rambo や development-chuck-norris といった設定セクションで利用できます)。

source: General topics
ja: 一般的なトピック

source: Is there a way to change the action method mappings of HTTP verbs (e.g. swap PUT/POST for RESTful applications)?
ja: HTTPメソッドにマップされたアクションメソッドを変更する (例えばPUTとPOST をRESTfulアプリ用に入れ替る)方法はありますか？

source: Is there any way to set a template file extension per output type?
ja: 出力形式ごとにテンプレートファイルの拡張子を設定する方法はありますか?

source: What's that isSimple() method all about (in an action)?
ja: (アクションの)isSimple()メソッドって一体なんですか?

source: How can I make use of that?
ja: どのように使うのですか?

source: How do I return XML to the client (like in an Atom/RSS newsfeed)?
ja: どのようにクライアントに(Atom/RSSのニュースフィードのような)XMLを返すの ですか?

source: How do I implement AJAX- or JSON-related solutions using Agavi?
ja: どのようにAgaviを使用してAJAXやJSONベースのソリューションを実装するのですか？

source: How to set a different exception template for AJAX requests?
ja: どのようにAJAXリクエストに対して別の例外テンプレートを設定するのですか？

source: Where to store application settings and how to access them?
ja: どこにアプリケーションの設定を保存し、どのようにアクセスするのですか？

source: How to set custom database connection properties?
ja: どのようにカスタムデータベースの設定プロパティを設定するのですか？

source: How to get HTTP_* variables?
ja: どのように HTTP_* 変数を取得するのですか？

source: What about cookies and how can I get/set/remove them?
ja: クッキーについてはどのように取得/設定/削除を行うのですか？

source: How to do forwards and redirects?
ja: どのようにフォワードやリダイレクトを行うのですか？

source: How to return HTTP status codes?
ja: どのようにHTTPステータスコードを返すのですか？

source: Where can I change the session settings?
ja: どこでセッション設定を変更できますか?

source: Fast!
ja: まず!

source: I need an example of slots and how to use them!
ja: スロットの例と使い方が必要だ!

source: How to load different layouts?
ja: どのように異なるレイアウトをロードするのですか？

source: How to re-use input templates to display errors?
ja: どのように入力テンプレートをエラー表示に再利用するのですか？

source: How to load another master template?
ja: どのように別のマスターテンプレートを読み込むのですか？

source: What is the Agavi startup sequence?
ja: Agaviの起動シーケンスとは何ですか？

source: What do I need to know about Agavi models and how to use them?
ja: Agaviのモデルについて何か知っておくべきことはありますか？またどのように使うのですか？

source: How to use custom configuration files?
ja: どのようにカスタム設定ファイルを使うのですか？

source: Is it possible to change the directory structure of a module?
ja: モジュールのディレクトリ構造を変更することはできますか？

source: Routing related topics
ja: ルーティングに関するトピック

source: What do I have to know about Agavi's routing system?
ja: Agaviのルーティングシステムについて知っておくことはありますか？

source: How to define default values for routing parameters?
ja: どのようにルーティングパラメータのデフォルト値を定義するのですか？

source: How to use those curly braces for min/max quantifiers?
ja: どのように最少/最大の量指定子用の波括弧を使えばいいですか？

source: How to make route pattern matching case-insensitive?
ja: どのように大文字と小文字を区別しないでマッチするルートパターンを作ればよいですか？

source: What additional options are there to be specified when generating routes?
ja: 生成時に指定できる追加オプションはどのようなものがありますか？

source: How to determine the current matched routes?
ja: 現在の一致したルートを特定するには？

source: What are routing callbacks and how can I use them?
ja: ルーティングコールバックとは何でどう使うのですか？

source: How do I generate routes with different output types?
ja: どのように異なった出力形式を持つルートを生成するのですか？

source: Validation related topics
ja: バリデーションに関するトピック

source: What are the validation modes and what do I need to know about them?
ja: バリデーションモードとはなんですか？またそれについて知っておくべきことはなんですか？

source: Is it possible to define nested validators?
ja: 入れ子のバリデータを定義できますか？

source: What is the name of a validator for?
ja: 何のためにバリデータの名前はあるのですか？

source: How to prevent performing other validations on a field in case one validator fails?
ja: どうやって、一つのバリデーションが失敗したフィールド上の他のバリデーションを回避するのですか？

source: Can validators depend on other validators?
ja: バリデータは他のバリデータに依存できますか？

source: Can the "depends" attribute receive more than one dependency?
ja: "depends"属性には複数の依存関係を設定できますか？

source: Is there a possibility to register validators manually in an action?
ja: アクション内でバリデータを手動登録できますか？

source: Is there any example of custom file validations or the AgaviImageFileValidator?
ja: カスタムされたファイルバリデータ やAgaviImageFileValidatorの例はありますか?

source: How can I repopulate readonly/disabled input fields?
ja: どのように読み取り専用や無効になっている入力フィールドを再投入できますか？

source: How to manually output error messages in a view?
ja: ビューにおいて手動でエラーを出力するには、どのようにすればよいですか？

source: Is there a better way than using isSet or isNotEmpty to validate route parameters?
ja: ルートパラメータをバリデートするためにisSet やisNotEmptyを利用する以外のより良い方法はありますか？

source: How do I use the inarray validator?
ja: どのようにinarrayバリデータを使えばよいですか？

source: How do I validate array input?
ja: どのように配列入力をバリデートすればよいですか？

source: Is there an example for the AgaviDateTimeValidator?
ja: AgaviDateTimeValidatorの例はありますか？

source: How do I check validation results and retrieve the incidents of a failed validator?
ja: どのようにバリデーション結果をチェックしたり、失敗したバリデータのインシデントを取得できますか？

source: How to handle checkbox input fields?
ja: どのようにチェックボックス入力フィールドを扱えばよいですか？

source: I'm writing the same validation code over and over again, which doesn't feel very DRY.
ja: 同じバリデーションコードを何度も何度も書いています。これでは全然DRYじゃないです。

source: How to solve this?
ja: どうすればよいですか？

source: How to write a custom validator?
ja: どのようにカスタムバリデータを書けばよいですか？

source: How to register shortnames for validators and why should I use them?
ja: どのようにバリデータの短縮名を登録しますか？またなぜそうした方がよいのですか？

source: Caching related topics
ja: キャッシングに関するトピック

source: Is it possible to (globally) enable or disable fragment caching?
ja: フラグメントキャッシュを(グローバルに)有効または無効にすることはできますか？

source: What are caching groups and how are they used for fragment caching?
ja: キャッシンググループとはなんですか？またどのように作用するのですか？

source: Which source attribute values are available and what do they do?
ja: どのsource属性値が利用可能で、それらは何を行うのですか?

source: Any tips before starting to use fragment caching intensively?
ja: フラグメントキャッシュを利用する前に知っておくべきことはありますか？

source: Translation related topics
ja: 翻訳に関するトピック

source: Quickstart
ja: クイックスタート

source: How do I use and customize a currency format?
ja: 通貨フォーマットはどのように使ったりカスタマイズしたりするのですか？

source: Filter related topics
ja: フィルターに関するトピック

source: What kind of filters are available by default and how to configure them?
ja: デフォルトではどのようなフィルターが利用可能ですか？また、それらはどのように設定するのですか？

source: tbd (FormPopulationFilter tipps)
ja: tbd (FormPopulationFilterのtips)

source: What's the execution order of filters?
ja: どのようなフィルタの実行順序ですか？

source: Testing related topics
ja: テストに関するトピック

source: How do I start?
ja: どのように始めればよいですか？

source: Misc topics
ja: その他

source: How do I get improved code completion in Netbeans or Eclipse or $favoriteIDE?
ja: NetbeansやEclipseまたは$favoriteIDEで上手くコード補完を得るにはどうすればよいですか？

source: How do I set an exit code in console context or shell applications?
ja: どのようにして、コンテキストまたはシェルコンソールアプリケーションで終了コードを設定するのですか？
